/*
*********************************************************************
* Copyright(C) 2019 南京新联电子股份有限公司
* All rights reserved. 
* @brief： 功能描述
* @date： 2019-10-25
*********************************************************************
*/


#ifndef __CCO_GUI_H__
#define __CCO_GUI_H__

#include "../crt_common/CcoRedef.h"

#ifdef __cplusplus
extern "C" {
#endif

#if defined(_MSC_VER)
#pragma warning(disable:4201)
#endif

/*******************************************************************************
* 本地通信app 显示GUI相关接口
*******************************************************************************/

/*******************************************************************************
* 函数名称: gui_hplc_fr_query
* 函数功能: 显示GUI 查看当前HPLC频点
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: uint8 *Fr 频点值
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_hplc_fr_query(uint8 ModuleID, uint8 *Fr);


/*******************************************************************************
* 函数名称: gui_amr_port_query
* 函数功能: 显示GUI 查看当前抄表端口信息
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: uint32 *Port 端口号
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_amr_port_query(uint8 ModuleID, uint32 *Port);


/*******************************************************************************
* 函数名称: gui_module_addr_query
* 函数功能: 显示GUI 查看当前模块地址
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
			uint8 Len 地址缓冲区长度(6)
* 输出参数: uint8 *Addr 模块地址
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_module_addr_query(uint8 ModuleID, uint8 Len, uint8 *Addr);


/*******************************************************************************
* 函数名称: gui_module_info_query
* 函数功能: 显示GUI 查看模块参数及信息
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: AMR_QUERY_MODULE_INFO_T *ModuleInfo 模块信息
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_module_info_query(uint8 ModuleID, AMR_QUERY_MODULE_INFO_T *ModuleInfo);


/*******************************************************************************
* 函数名称: gui_amr_state_query
* 函数功能: 显示GUI 查询当前抄表状态
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: AMR_QUERY_READING_STATE_T *AmrState 抄表状态
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_amr_state_query(uint8 ModuleID, AMR_QUERY_READING_STATE_T *AmrState);


/*******************************************************************************
* 函数名称: gui_area_iden_query
* 函数功能: 显示GUI 查看当前HPLC台区识别开启状态
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: >=0:开关状态； -1:错误
*******************************************************************************/
extern int gui_area_iden_query(uint8 ModuleID);


/*******************************************************************************
* 函数名称: gui_offline_feel_query
* 函数功能: 显示GUI 查看当前HPLC离网感知开启状态
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: >=0:开关状态； -1:错误
*******************************************************************************/
extern int gui_offline_feel_query(uint8 ModuleID);


/*******************************************************************************
* 函数名称: gui_refuse_report_query
* 函数功能: 显示GUI 查看当前HPLC拒绝节点上报开启状态
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: >=0:开关状态； -1:错误
*******************************************************************************/
extern int gui_refuse_report_query(uint8 ModuleID);


/*******************************************************************************
* 函数名称: gui_files_count_query
* 函数功能: 显示GUI 查看档案数量
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: >=0:档案数量； -1:错误
*******************************************************************************/
extern int gui_files_count_query(uint8 ModuleID);


/*******************************************************************************
* 函数名称: gui_single_files_query
* 函数功能: 显示GUI 查看单个档案信息
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
			uint16 index 档案列表数组下标(从0开始)
* 输出参数: AMR_METER_FILES_INFO_T *FilesInfo 单个档案信息
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_single_files_query(uint8 ModuleID, uint16 index, AMR_METER_FILES_INFO_T *FilesInfo);

/*******************************************************************************
* 函数名称: gui_restart_app
* 函数功能: 显示GUI 对本应用软件重启
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_restart_app(uint8 ModuleID);


/*******************************************************************************
* 函数名称: gui_hardware_init
* 函数功能: 显示GUI 硬件复位路由
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_hardware_init(uint8 ModuleID);

/*******************************************************************************
* 函数名称: gui_param_init
* 函数功能: 显示GUI 初始化参数
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_param_init(uint8 ModuleID);

/*******************************************************************************
* 函数名称: gui_software_info_query
* 函数功能: 显示GUI 查询软件版本和发布日期
* 输入参数: uint8 ModuleID 本地模块序号(1或者2)
* 输出参数: 无
* 返 回 值: 大于0：正确；小于0：错误
*******************************************************************************/
extern int gui_software_info_query(uint8 ModuleID, MODULE_INFO_T *pModuleInfo);


#ifdef __cplusplus
}
#endif

#endif // __CCO_GUI_H__